benchmark_results/benchmark_20260401_112500.txt
==========================================
   压测报告 - Wed Apr  1 11:25:00 CST 2026
==========================================

Gateway: http://localhost:8080
Job Service: http://localhost:8082
Talent Service: http://localhost:8086
Recommendation Service: http://localhost:8087

This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /health
Document Length:        301 bytes

Concurrency Level:      100
Time taken for tests:   0.108 seconds
Complete requests:      5000
Failed requests:        4900
   (Connect: 0, Receive: 0, Length: 4900, Exceptions: 0)
Non-2xx responses:      4900
Keep-Alive requests:    5000
Total transferred:      1063900 bytes
HTML transferred:       240800 bytes
Requests per second:    46330.19 [#/sec] (mean)
Time per request:       2.158 [ms] (mean)
Time per request:       0.022 [ms] (mean, across all concurrent requests)
Transfer rate:          9627.09 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0    2   2.1      2      18
Waiting:        0    2   2.1      2      18
Total:          0    2   2.1      2      18

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      3
  80%      3
  90%      5
  95%      6
  98%      8
  99%     12
 100%     18 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8082

Document Path:          /api/v1/jobs
Document Length:        4364 bytes

Concurrency Level:      100
Time taken for tests:   3.624 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      23460000 bytes
HTML transferred:       21820000 bytes
Requests per second:    1379.80 [#/sec] (mean)
Time per request:       72.474 [ms] (mean)
Time per request:       0.725 [ms] (mean, across all concurrent requests)
Transfer rate:          6322.31 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:     1   71  85.0     15     589
Waiting:        1   71  85.0     15     589
Total:          1   71  85.0     15     589

Percentage of the requests served within a certain time (ms)
  50%     15
  66%    141
  75%    154
  80%    158
  90%    171
  95%    190
  98%    307
  99%    321
 100%    589 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8086

Document Path:          /api/v1/talents
Document Length:        4785 bytes

Concurrency Level:      100
Time taken for tests:   1.700 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      25565000 bytes
HTML transferred:       23925000 bytes
Requests per second:    2941.49 [#/sec] (mean)
Time per request:       33.996 [ms] (mean)
Time per request:       0.340 [ms] (mean, across all concurrent requests)
Transfer rate:          14687.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       5
Processing:     0   33  59.5      2     308
Waiting:        0   33  59.5      2     308
Total:          0   33  59.6      2     308

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      3
  75%      5
  80%    123
  90%    145
  95%    151
  98%    174
  99%    177
 100%    308 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8087

Document Path:          /api/v1/recommendations/stats
Document Length:        264 bytes

Concurrency Level:      100
Time taken for tests:   1.228 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    5000
Total transferred:      3185000 bytes
HTML transferred:       1320000 bytes
Requests per second:    4073.02 [#/sec] (mean)
Time per request:       24.552 [ms] (mean)
Time per request:       0.246 [ms] (mean, across all concurrent requests)
Transfer rate:          2533.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0   24  48.4      2     260
Waiting:        0   24  48.4      2     260
Total:          0   24  48.5      2     260

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      3
  80%      5
  90%    114
  95%    121
  98%    146
  99%    170
 100%    260 (longest request)